set_property SRC_FILE_INFO {cfile:/home/link/CODE/projects/AdiRISCV/fpga/constraints.xdc rfile:../../../../fpga/constraints.xdc id:1} [current_design]
set_property src_info {type:XDC file:1 line:10 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 10.000 -name sys_clk_pin -waveform {0.000 5.000} -add [get_ports clk]
set_property src_info {type:XDC file:1 line:66 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks sys_clk_pin] -min 2.000 [get_ports {reset_n {btn[*]} {sw[*]}}]
set_property src_info {type:XDC file:1 line:67 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks sys_clk_pin] -max 5.000 [get_ports {reset_n {btn[*]} {sw[*]}}]
set_property src_info {type:XDC file:1 line:70 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks sys_clk_pin] -min -1.000 [get_ports {{led[*]} {led_r[*]} {led_g[*]} {led_b[*]}}]
set_property src_info {type:XDC file:1 line:71 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks sys_clk_pin] -max 5.000 [get_ports {{led[*]} {led_r[*]} {led_g[*]} {led_b[*]}}]
set_property src_info {type:XDC file:1 line:74 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks sys_clk_pin] 2.000 [get_ports uart_rxd]
set_property src_info {type:XDC file:1 line:75 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks sys_clk_pin] 2.000 [get_ports uart_txd]
set_property src_info {type:XDC file:1 line:78 export:INPUT save:INPUT read:READ} [current_design]
set_max_delay -from [all_inputs] -to [all_outputs] 15.000
set_property src_info {type:XDC file:1 line:107 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -from [get_ports reset_n] -to [all_registers]
